#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Version constraints inside provider configuration blocks are deprecated

  on provider.tf line 10, in provider "aws":
  10:   version = "5.1.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ssm_parameter.foo: Refreshing state... [id=foobar3]
aws_vpc.main: Refreshing state... [id=vpc-06f2a898a07dae15c]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_vpc.main must be replaced
-/+ resource "aws_vpc" "main" {
      ~ arn                                  = "arn:aws:ec2:ca-central-1:199660179115:vpc/vpc-06f2a898a07dae15c" -> (known after apply)
      - assign_generated_ipv6_cidr_block     = false -> null
      ~ cidr_block                           = "10.0.0.0/16" -> "10.1.0.0/16" # forces replacement
      ~ default_network_acl_id               = "acl-0b324b2cf65d7b2a6" -> (known after apply)
      ~ default_route_table_id               = "rtb-0147326d0e6dfb98e" -> (known after apply)
      ~ default_security_group_id            = "sg-0a3893514c43bdf27" -> (known after apply)
      ~ dhcp_options_id                      = "dopt-0b0ba010a7ae263cd" -> (known after apply)
      ~ enable_dns_hostnames                 = false -> (known after apply)
      ~ enable_network_address_usage_metrics = false -> (known after apply)
      ~ id                                   = "vpc-06f2a898a07dae15c" -> (known after apply)
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      - ipv6_netmask_length                  = 0 -> null
      ~ main_route_table_id                  = "rtb-0147326d0e6dfb98e" -> (known after apply)
      ~ owner_id                             = "199660179115" -> (known after apply)
        tags                                 = {
            "Name" = "main-vpc"
        }
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + filename = "."

Warning: Version constraints inside provider configuration blocks are deprecated

  on provider.tf line 10, in provider "aws":
  10:   version = "5.1.0"

Terraform 0.13 and earlier allowed provider version constraints inside the
provider configuration block, but that is now deprecated and will be removed
in a future version of Terraform. To silence this warning, move the provider
version constraint into the required_providers block.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dtaylor77, Action: `pull_request`*